HelpText = {}

function HelpText:helpChuancheng()
return {
        RTE("传承帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 传承可以将神器属性从一件装备转移到另一件装备上",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 传承时只能传承给同一个位置的非神器装备",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 传承需要花费一定量的金币",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
}	
end

function HelpText:helpQianghua()
return {
        RTE("强化帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 强化可以提升装备的基本属性",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 强化需要消耗一定量的强化精华与金币",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 强化精华可以通过挑战副本BOSS获得",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 熔炼卖出已强化的装备会返还全部强化精华",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
}   
end
function HelpText:helpFriendShre()
    return {  
        RTE("好友奖励帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 您可以把您的邀请码发给您的好友来邀请他们来玩天天挂机",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 您的好友创建角色和登陆前7天都可以在这里输入您的邀请码",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 输入邀请码确定后他们将获得20个强化精华与10万金币的奖励",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 而您可以在他们充值时获得他们充值钻石数量10%的返利",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 首充三倍，月卡等活动额外赠送的钻石不在返利范围内",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 您每天还有1次分享获得金币的机会",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 只要分享就能获得等级x1000的金币，每天一次别忘记哦！",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),    
    }   
end
function HelpText:helpRonglian()
    return {  
        RTE("熔炉重铸与打造",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 您可以将不需要的装备扔进熔炉进行熔炼。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 熔炉会有一定的概率重铸您扔进去的装备\n   重铸后的装备将比原来的装备高一个品质\n   如果原始装备是橙色装备将重铸成神器",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 如果装备未发生重铸，那么这件装备将消失，您将\n   获得一定的熔炼值熔炼值可以用来打造新装备",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 在打造前您可以通过刷新来选择一件你想要打造的\n   装备多次刷新需消耗一定量的钻石",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
    }   
end
function HelpText:helpDaZao()
	return{
        RTE("打造帮助\n",30,cc.c3b(0,255,0)), 
        RTE("● 打造可以将当前显示的装备打造出来\n",25,cc.c3b(255,255,255)),
        RTE("   打造时需要消耗一定量的熔炼值\n",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 除了装备外，还可以打造用来给装备开孔的开孔锤\n",25,cc.c3b(255,255,255)),
        RTE("● 点击刷新按钮可以刷新一个新的可打造装备\n",25,cc.c3b(255,255,255)),
        RTE("\n"),
	}
end
function HelpText:helpTunshi()
    return {
        RTE("吞噬帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 神器可以通过吞噬其他神器来提升神器属性的等级",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 神器吞噬可以吞噬所有位置上的神器",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 吞噬时获得的经验值与被吞噬神器本身拥有的经验值有关",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("  当经验值满时神器属性会升级并获得提升",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
    }   
end

function HelpText:helpXilian()
    return {
        RTE("洗练帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 洗练可以重新分配装备的\n  力量敏捷智力耐力属性",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 重置时属性点数的总和保持不变\n  属性条数保持不变",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 重置时不会影响装备的其他属性",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 高级洗练时更容易获得单一属性值很高的极端属性",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
    }   
end

function HelpText:helpSkill()
    return {
        RTE("技能帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 随着您等级的提升，您可以学习共计10个技能，您最多可以装备其中的4个",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 在战斗过程中，技能会按您设定的顺序施放，每回合施放一个。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 所有已装备的技能施放完毕后，您会进行两次普通攻击，攻击完后继续施放技能。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 技能施放需要消耗一定的魔法值，当您的魔法值不足时，该回合将被普通攻击代替。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 直接造成百分比伤害的技能一定命中，且无法暴击。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("状态介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("部分技能会对己方与敌方施加一些状态，这些状态会持续一定回合并影响战斗",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 晕眩:晕眩状态时将无法行动",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 冻结:冻结状态时将无法行动",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 沉默:沉默状态时将无法使用技能",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 致盲:命中降低70%",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 盾墙:减少50%受到的伤害",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 鼓舞:伤害提升30%，护甲提升50%",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 虚弱:伤害降低30%",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 狂暴:普通攻击100%暴击，且免疫所有不良状态",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 中毒:每回合减少4%当前生命值",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 破甲:护甲降低80%",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 燃烧:每回合造成50%的魔法伤害",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 冰甲:被普通攻击时50%概率冻结攻击者1回合",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 流血:无法回复生命",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 魔箭:普通攻击时附加伤害50%的魔法伤害",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 加攻:伤害提升100%",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 隐身:只会受到全体攻击伤害",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 魔法盾:1点魔法值可以抵消5点伤害",25,cc.c3b(255,255,255)),RTE("\n"),
    }   
end

function HelpText:helpMain()
return {
--        RTE("如果您遇到问题请您加我们的GM服务QQ:\n",30,cc.c3b(0,204,255)),
--        RTE("800045778",30,cc.c3b(0,204,255)),
--        RTE("(在QQ添加好友/找服务里面可以搜到)\n",30,cc.c3b(0,204,255)),
        RTE("如果您遇到问题请您加我们的\nGM服务QQ:"..Config.gmQQ.."(在QQ添加好友/找服务里面可以搜到)\n",30,cc.c3b(0,204,255)),RTE("\n"),
        RTE(" \n",30,cc.c3b(0,204,255)),
        RTE("升级打怪",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 天天挂机里所有的升级打怪都是自动进行，无需您手动操作，甚至于您退出游戏后仍然在默默帮您离线打怪升级拿装备，当您再次登陆的时候就能获得您离开这段时间的所有收益。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 离线挂机最长持续时间为24小时，当您的背包满时会自动将之后获得装备卖出。您可以在战斗设置里设置自动卖出来防止背包变满的情况。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 除了挂机外，您还可以选择挑战关卡BOSS，战胜BOSS可以开启下一级别的关卡；之后您可以通过更换地图更换至下一级别关卡挂机，来获得更多的经验金币与更好的装备。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("职业介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("天天挂机里共有3个职业，分别为战士，猎人，法师",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 战士能装备剑与盾，主属性是力量",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 猎人能装备弓与箭筒，主属性是敏捷",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 法师能装备法杖与法典，主属性是智力",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("装备系统介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("您总共有10个部位可装备共10种不同类型的装备。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 装备一共有6种品质，分别为对应的颜色为",25,cc.c3b(255,255,255)),RTE("白色（普通）",25,cc.c3b(96,96,96)),RTE("→绿色（优秀）",25,cc.c3b(71,179,56)),
        RTE("→蓝色（精良）",25,cc.c3b(0,125,247)),RTE("→紫色（史诗）",25,cc.c3b(184,0,239)),
        RTE("→橙色（传说）",25,cc.c3b(227,144,60)),RTE("→闪光（神器）",25,cc.c3b(227,144,60)),RTE("\n"),
        RTE("● 装备的附加属性有力量，敏捷，智力，耐力四种，装备的附加属性条数跟装备的颜色有关，附加属性的数值跟装备的等级有关。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 神器会额外有一条的强力的神器属性。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 强化可以提升装备的基本属性。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 洗练可以重置装备的附加属性。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 神器传承可以将神器属性转移到另一件装备上。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 神器吞噬可以提高神器的神器属性。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 不需要的装备可以扔进熔炉进行重铸和打造。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("技能介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("随着您等级的提升，您会学会各种强力技能，并在战斗中使用他们",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("雇佣兵介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("您在达到15级后就可以携带1位雇佣兵帮助战斗。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 雇佣兵不用您特意为他升级，他的等级将跟您的等级保持一致。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 雇佣兵只能装备主手武器，副手武器，胸甲，腿甲4个装备，并拥有一个技能。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 雇佣兵的技能会在战斗过程中按概率随机施放。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 您可以通过对雇佣兵进行培养来提升雇佣兵的基础属性。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("商城介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("在商城里您可以直接花费金币与钻石购买装备与道具。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 商城一页有6件商品，提高VIP等级可额外获得高级物品栏销售高级商品。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 当您将商城的商品全部购买完时，商城将更换一批新商品，而且新商品的质量将有一定概率获得提升。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 商城中偶尔也会出售神器碎片，10个神器碎片可以合成一个神器。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
        RTE("竞技场介绍",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 您可以在竞技场里向其他排名比你高的玩家发起挑战，如果您赢了，您将与该玩家互换位置，输了也不会对您有什么影响。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 每次挑战您都可以在3位玩家中任意选择，如果您不想与这3位玩家PK，您可以点击换一批按钮更换对手。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 每天21点，系统会根据当时排行榜的排行发放排行奖励。",25,cc.c3b(255,255,255)),RTE("\n"),
    }
end
function HelpText:helpGemEmbed()
    return{
        RTE("镶嵌帮助\n",30,cc.c3b(0,255,0)),
        RTE("● 带有宝石孔的装备可以通过镶嵌宝石来提升装备属性\n",25,cc.c3b(255,255,255)),
        RTE("● 同种颜色的宝石在一件装备上面只能镶嵌1个\n",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 蓝色装备最多有1个宝石孔\n   紫色装备最多有2个宝石孔\n",25,cc.c3b(255,255,255)),
        RTE("   橙色装备最多有4个宝石孔\n",25,cc.c3b(255,255,255)),
        RTE("● 人物等级达到20级后，如果装备当前的宝石孔数未达最大值，您可以对其打孔\n",25,cc.c3b(255,255,255)),
        RTE("● 打第1个孔需要花费一定量的金币\n",25,cc.c3b(255,255,255)),
        RTE("   打第2,3,4个孔分别需要1个小铜锤，小银锤和小金锤\n",25,cc.c3b(255,255,255)),
        RTE("● 打孔锤可以在熔炉里打造获得",25,cc.c3b(255,255,255)),
        RTE("\n"),
    }
end
function HelpText:helpGemUp()
    return{
        RTE("宝石升级帮助\n",30,cc.c3b(0,255,0)),
        RTE("● 低级宝石可以通过升级变成更高级的宝石\n",25,cc.c3b(255,255,255)),
        RTE("● 升级需要花费一定量的金币\n",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 3级以上",25,cc.c3b(0,255,0)),RTE("宝石升级时还会需要指定数量的低级宝石\n",25,cc.c3b(255,255,255)),
        RTE("● 宝石升级时有一定概率",25,cc.c3b(255,255,255)),RTE("失败",25,cc.c3b(255,0,0)),RTE("\n"),
        RTE("   宝石升级失败时会增加一定数量的幸运值\n",25,cc.c3b(255,255,255)),
        RTE("● 幸运值越高，宝石升级的成功率越高\n",25,cc.c3b(255,255,255)),
        RTE("   当幸运值满时，宝石升级100%成功\n",25,cc.c3b(255,255,255)),
        RTE("● 宝石升级成功时，幸运值将清零\n",25,cc.c3b(255,255,255)),
        RTE("\n"),
    }
end
function HelpText:helpGvg()
    return { 
        RTE("多人团战帮助\n",30,cc.c3b(0,255,0)),
        RTE("● 多人团战是10人VS10人的团队战斗\n",25,cc.c3b(255,255,255)),
        RTE("● 您可以免费加入其他团队\n  也可以花费钻石创建自己的战队\n",25,cc.c3b(255,255,255)),
        RTE("● 创建战队时系统会随机给予队长9名队员组成一个战队\n",25,cc.c3b(255,255,255)),
        RTE("  队长对部分队员不满意时可以花费少量钻石更换队员\n",25,cc.c3b(255,255,255)),
        RTE("● 比赛形式为淘汰赛\n  赢的队伍继续战斗，输的队伍结束比赛\n",25,cc.c3b(255,255,255)),
        RTE("● 组建战队的队长能获得等级*3000的金币奖励\n",25,cc.c3b(255,255,255)),
        RTE("  报名参赛的队员能获得等级*1000的金币奖励\n",25,cc.c3b(255,255,255)),
        RTE("● 每获胜一场，队长和队员都可获得等级*1000的金币奖励\n",25,cc.c3b(255,255,255)),
        RTE("● 队长可以额外获得1个宝石袋奖励\n",25,cc.c3b(255,255,255)),
        RTE("● 冠军队伍队长和队员获得1个高级宝石，宝石颜色为：\n",25,cc.c3b(255,255,255)),
        RTE("● 周一周四为红宝石，周二周五为绿宝石\n",25,cc.c3b(255,255,255)),
        RTE("● 周三周六为蓝宝石，周日为黄宝石",25,cc.c3b(255,255,255)),
        RTE("\n"),
    }
end
function HelpText:helpClub()
    return {
        RTE("公会帮助\n",30,cc.c3b(0,255,0)),
        RTE("● 公会成员每日进入公会签到，可获得经验、贡献、金币奖励\n",25,cc.c3b(255,255,255)),
        RTE("● 公会成员可在贡献兑换处兑换各式限量道具\n",25,cc.c3b(255,255,255)),
        RTE("● 若您对当前公会不满意，您可在公会成员面板退出公会，退出公会后您的贡献将被清空\n",25,cc.c3b(255,255,255)),
        RTE("\n BOSS入侵活动帮助\n",30,cc.c3b(0,255,0)),
        RTE("● BOSS入侵活动需会长或副会长手动开启\n",25,cc.c3b(255,255,255)),
        RTE("● 每周可免费开启2次，后续开启需花费钻石",25,cc.c3b(255,255,255)),
        RTE("  您只需在活动开启后，点击加入战斗即可轻松获得收益\n",25,cc.c3b(255,255,255)),
        RTE("  一个人一周只能参与一个公会的魔兽入侵\n",25,cc.c3b(255,255,255)),
        RTE("● 通过参与BOSS入侵活动，可大量获得公会升级经验\n  及个人贡献 ",25,cc.c3b(255,255,255)),
        RTE("  BOSS入侵活动个人贡献是依据对BOSS伤害进行排行并按排名给予的，若想获得更多贡献，可进行鼓舞增加攻击，各个排名的贡献如下\n",25,cc.c3b(255,255,255)),
        RTE("● 第1名     总贡献的20%+魔兽等级*0.2的强化精华\n",25,cc.c3b(255,255,255)),
        RTE("● 第2名     总贡献的15%+魔兽等级*0.2的强化精华\n",25,cc.c3b(255,255,255)),
        RTE("● 第3名     总贡献的12%+魔兽等级*0.2的强化精华\n",25,cc.c3b(255,255,255)),
        RTE("● 第4名     总贡献的10%\n",25,cc.c3b(255,255,255)),
        RTE("● 第5名     总贡献的9%\n",25,cc.c3b(255,255,255)),
        RTE("● 第6名     总贡献的8%\n",25,cc.c3b(255,255,255)),
        RTE("● 第7名     总贡献的7%\n",25,cc.c3b(255,255,255)),
        RTE("● 第8名     总贡献的6%\n",25,cc.c3b(255,255,255)),
        RTE("● 第9名     总贡献的5%\n",25,cc.c3b(255,255,255)),
        RTE("● 第10名    总贡献的4%\n",25,cc.c3b(255,255,255)),
        RTE("● 11名以上  总贡献的1%\n",25,cc.c3b(255,255,255)),
        RTE("● 对魔兽完成最后一击可以获得额外的金币奖励\n",25,cc.c3b(255,255,255)),
        RTE("● 如果未击杀魔兽所有奖励将减半，魔兽会降级\n",25,cc.c3b(255,255,255)),
        RTE("\n 公会管理帮助\n",30,cc.c3b(0,255,0)),
        RTE("●公会会长可在公会成员面板对成员进行踢出、任命操作 \n",25,cc.c3b(255,255,255)),
        RTE("●  累计总贡献达到公会等级*200才可以被任命为副会长\n",25,cc.c3b(255,255,255)),
        RTE("●  公会会长最多只能任命与公会等级相同数量的副会长\n",25,cc.c3b(255,255,255)),
        RTE("● 公会会长可在公会管理面板设定公告内容\n",25,cc.c3b(255,255,255)),
        RTE("● 公会会长可在公会管理面板设定加入公会战力条件\n",25,cc.c3b(255,255,255)),
        RTE("● 为了更快更好提升公会等级，建议会长开启魔兽入侵\n 活动的时间及时传达给各位公会成员\n",25,cc.c3b(255,255,255)),
        RTE("\n")
    }
end
function HelpText:helpClubPvp()
    return {
        RTE("公会争霸赛帮助\n",30,cc.c3b(0,255,0)),
        RTE("● 公会等级大于等于3级可参与公会争霸赛\n",25,cc.c3b(255,255,255)),
        RTE("● 每周日开启争霸赛报名，报名公会数大于等于64方可正常开启，否则本周将不进行争霸赛\n",25,cc.c3b(255,255,255)),
        RTE("● 共包含预赛、64强、32强、16强、8强、半决赛、决赛7个阶段，除预赛需报名外，其他阶段胜出者参与\n",25,cc.c3b(255,255,255)),
        RTE("● 预赛报名时间为周日9时起，开战时间都为20时\n",25,cc.c3b(255,255,255)),
        RTE("● 会长可在公会成员界面内设置争霸赛前后排成员\n",25,cc.c3b(255,255,255)),
        RTE("● 前排成员将优先承担敌方伤害，因此每次排兵都可能影响战局\n",25,cc.c3b(255,255,255)),
        RTE("● 比赛结束后玩家可查看战报\n",25,cc.c3b(255,255,255)),
        RTE("● 公会战开始后进入公会的成员无法获得公会战奖励\n",25,cc.c3b(255,255,255)),
        RTE("公会争霸赛奖励设定\n",30,cc.c3b(0,255,0)),
        RTE("  参与公会争霸赛即可获得大量金币奖励，每一阶段奖励如下：\n",25,cc.c3b(255,255,255)),
        RTE("●比赛阶段  金币奖励     帮派贡献奖励\n",25,cc.c3b(255,255,255)),
        RTE("● 预赛     等级*2000    淘汰30晋级50\n",25,cc.c3b(255,255,255)),
        RTE("● 64强     等级*2000    击杀人数*30\n",25,cc.c3b(255,255,255)),
        RTE("● 32强     等级*2000    击杀人数*40\n",25,cc.c3b(255,255,255)),
        RTE("● 16强     等级*2000    击杀人数*50\n",25,cc.c3b(255,255,255)),
        RTE("● 8强      等级*2000    击杀人数*60\n",25,cc.c3b(255,255,255)),
        RTE("● 半决赛   等级*2000    击杀人数*80\n",25,cc.c3b(255,255,255)),
        RTE("● 决赛     等级*4000    击杀人数*100\n",25,cc.c3b(255,255,255)),
        RTE("● 冠军     等级*4000    ---\n",25,cc.c3b(255,255,255)),
        RTE("  BOSS挑战券奖励如下：\n",25,cc.c3b(255,255,255)),
        RTE("●比赛阶段   会长奖励        会员奖励  \n",25,cc.c3b(255,255,255)),
        RTE("● 64强      BOSS挑战券*1      无\n",25,cc.c3b(255,255,255)),
        RTE("● 32强      BOSS挑战券*1      无\n",25,cc.c3b(255,255,255)),
        RTE("● 16强      BOSS挑战券*1      无\n",25,cc.c3b(255,255,255)),
        RTE("● 8强       BOSS挑战券*2      无\n",25,cc.c3b(255,255,255)),
        RTE("● 半决赛    BOSS挑战券*2      无\n",25,cc.c3b(255,255,255)),
        RTE("● 决赛      BOSS挑战券*2      BOSS挑战券*1\n",25,cc.c3b(255,255,255)),
        RTE("● 冠军      BOSS挑战券*4      BOSS挑战券*1\n",25,cc.c3b(255,255,255)),
        RTE("  声望奖励如下：\n",25,cc.c3b(255,255,255)),
        RTE("●比赛阶段   会长奖励        会员奖励  \n",25,cc.c3b(255,255,255)),
        RTE("● 预赛      声望*200        声望*50\n",25,cc.c3b(255,255,255)),
        RTE("● 64强      声望*200        声望*50\n",25,cc.c3b(255,255,255)),
        RTE("● 32强      声望*200        声望*50\n",25,cc.c3b(255,255,255)),
        RTE("● 16强      声望*300        声望*50\n",25,cc.c3b(255,255,255)),
        RTE("● 8强       声望*300        声望*100\n",25,cc.c3b(255,255,255)),
        RTE("● 半决赛    声望*400        声望*100\n",25,cc.c3b(255,255,255)),
        RTE("● 决赛      声望*400        声望*100\n",25,cc.c3b(255,255,255)),
        RTE("● 冠军      声望*500        声望*100\n",25,cc.c3b(255,255,255)),
        RTE("  上述所有奖励都可重复获得",25,cc.c3b(255,255,255)),
    }
end
function HelpText:helpTeShuDaZao()
    return {
        RTE("特殊打造系统",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 在这里您可以直接打造与一般神器属性不同的稀有神器。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 打造稀有神器需要您的声望达到一定的数量。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 您在竞技场每获得1点荣誉就会为您增加1点声望。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n")
    }
end
function HelpText:helpHonorExchange()
    
   
    --local reimg1 = ccui.RichElementImage:create(2,  cc.c3b(0,0,0), 255, "res/ui/images/img_08.png")
    
    return{
        RTE("荣誉兑换",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 荣誉是对您在竞技场里获得成绩的奖励。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 在这里您可以直接消耗一定量的荣誉兑换道具。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 当您将道具全部兑换完时，将更换一批新的道具。",25,cc.c3b(255,255,255)),RTE(""),
        reimg1,
        RTE("● 您也可以花费一定的荣誉刷新可兑换的道具。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
       
    }
end
function HelpText:helpPartnerZhuanjing()
    return {
        RTE("专精培养帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 专精培养给力敏智耐4项属性额外的属性加成",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 点击培养后每条专精都会随机出现一个成长值",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 力量专精：额外提升佣兵力量总和*成长值点物抗",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 敏捷专精：额外提升佣兵敏捷总和*成长值*1.5点暴击",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 智力专精：额外提升佣兵智力总和*成长值点魔抗",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 耐力专精：额外提升佣兵耐力总和*成长值*10点生命值",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 魔法专精：额外提升佣兵等级*成长值*20点魔法值",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 您可以把满意的专精成长值锁定，培养时将不会改变该专精",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
    }
end
function HelpText:helpPartnerSkill()
    return {
        RTE("技能刷新帮助",30,cc.c3b(0,255,0)),RTE("\n"),
        RTE("● 您可以通过刷新技能来更换佣兵的技能",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 刷新时将出现该职业所有可装备的技能",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 您可以把满意的技能锁定，该技能下次刷新时将不会刷新",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 佣兵技能按顺序施放，施放完毕后会进行两次普通攻击后重新施放",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("● 技能施放消耗一定的魔法值，魔法值不足时，将被普通攻击代替。",25,cc.c3b(255,255,255)),RTE("\n"),
        RTE("\n"),
    }
end