
local NewGuide = {
}

function NewGuide:show(onClose)
    local content = {
        RTE("请！注！意！\n", 40,cc.c3b(255,38,38)),

        RTE("这是一款跟你以前玩过的RPG都不一样的游戏！它是全球首款",25,cc.c3b(255,255,255)),
        RTE(" 放 置 类 RPG 游戏",25,cc.c3b(0,255,38)),
        RTE("，意味着枯燥乏味的不停手工打怪的时代已经一去不复返了！！！！\n",25,cc.c3b(255,255,255)),

        RTE("在这里打怪都是",25,cc.c3b(255,255,255)),
        RTE("自！动！的！",25,cc.c3b(0,255,38)),
        RTE("从你创建人物开始就，就会不停地自动打怪，获得经验和金币、掉落装备！\n",25,cc.c3b(255,255,255)),


        RTE("即使退出游戏也",25,cc.c3b(255,255,255)),
        RTE("不！会！停！",25,cc.c3b(255,38,38)),
        RTE("随时再回到游戏就可以收获一堆经验金币和装备！怎么样够爽吧！！？？\n",25,cc.c3b(255,255,255)),

        RTE("你所要做的就是挑选最好的装备给你的人物和佣兵穿上，不断挑战BOSS和其他玩家，最终达到实力的巅峰迎娶",25,cc.c3b(255,255,255)),
        RTE("白富美！\n",25,cc.c3b(255,0,216)),

        RTE("还不赶紧试试？\n",25,cc.c3b(255,255,255))
    }
  DialogManager:showDialog("InfoDialog", "游戏提示", content, onClose)
end

return NewGuide