ConfigData = {
    cfgInited = false,
    cfg_userlv = {},
    cfg_skill = {},
    cfg_equip = {},
    cfg_map = {},
    cfg_equip_exp = {},
    cfg_vip = {},
    cfg_vip_max = 0,
    cfg_buy_coin = {},
    cfg_item = {},
    cfg_gem = {},
    cfg_chenghao = {},
    cfg_equip_etype = {
        [1] = "主手武器",
        [2] = "副手武器",
        [3] = "头部",
        [5] = "胸部",
        [6] = "腰部",
        [7] = "腿部",
        [8] = "脚部",
        [10] = "手部",
        [12] = "项链",
        [14] = "戒指"
    },
    cfg_equip_etype2 = {
        [1] = "武器",
        [2] = "副手",
        [3] = "头部",
        [5] = "胸部",
        [6] = "腰部",
        [7] = "腿部",
        [8] = "鞋子",
        [10] = "手部",
        [12] = "项链",
        [14] = "戒指"
    },
    cfg_jobs = {
        [1] = "战士",
        [2] = "猎人",
        [3] = "法师"
    },
    cfg_equip_prop = {},
    cfg_buff = {
    -- { "BUFF名", 正面还是负面 }
    [1]={"晕眩", 1},
    [2]={"冻结", 1},
    [3]={"沉默", 1},
    [4]={"致盲", 1},
    [5]={"盾墙", 2},
    [6]={"狂怒回复", 2},
    [7]={"鼓舞", 2},
    [8]={"虚弱", 1},
    [9]={"狂暴", 2},
    [10]={"中毒", 1},
    [11]={"嗜血", 2},
    [12]={"破甲", 1},
    [13]={"燃烧", 1},
    [14]={"冰甲", 2},
    [15]={"流血", 1},
    [16]={"魔箭", 2},
    [17]={"加攻", 2},
    [18]={"隐身", 2},
    [19]={"魔法盾", 2},
  },
  
  cfg_ug_price = {
    [1] = { 30, 300 },
    [2] = { 500, 5000 },
    [3] = { 300, 3000 },
    [4] = { 100, 1000 },
    [5] = { 50, 500 },
    [6] = { 10, 100 }
  },
  
  cfg_ug_price_appstore={
    [1] = { 30, 300 },
    [2] = { 518, 5180 },
    [3] = { 308, 3080 },
    [4] = { 108, 1080 },
    [5] = { 50, 500 },
    [6] = { 6, 60 } 
  },

  cfg_club_lv = {
    [0] = 0,
    [1] = 3000,
    [2] = 10000,
    [3] = 25000,
    [4] = 64000,
    [5] = 155000,
    [6] = 338000,
    [7] = 665000,
    [8] = 1200000,
    [9] = 2019000,
    [10] = 0
  },
  
  cfg_club_shop = {
    [1] = {itemid = 12, dkp = 120, num = 1},
    [2] = {itemid = 11, dkp = 1000, num = 1},
    [3] = {itemid = 41, dkp = 160, num = 1},
    [4] = {itemid = 42, dkp = 500, num = 1},
    [5] = {itemid = 21, dkp = 80, num = 1},
    [6] = {itemid = 22, dkp = 250, num = 1}
  },
  
  cfg_honor_shop = {
    [4] = {cost = 200},
    [11] = {cost = 300},
    [12] = {cost = 30},
    [13] = {cost = 300},
    [41] = {cost = 50},
    [42] = {cost = 150},
    [43] = {cost = 400}
  }
}
